<a href="https://colab.research.google.com/github/parikannappan/python_learning/blob/master/handle_nan.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import pandas as pd
import numpy as np

In [5]:
df1 = pd.DataFrame({'age': [5, 6, np.NaN],
                   'born': [pd.NaT, pd.Timestamp('1939-05-27'),
                            pd.Timestamp('1940-04-25')],
                   'name': ['Alfred', 'Batman', ''],
                   'toy': [None, 'Batmobile', 'Joker']})

In [6]:
df1

   age       born    name        toy
0  5.0        NaT  Alfred       None
1  6.0 1939-05-27  Batman  Batmobile
2  NaN 1940-04-25              Joker

In [8]:
df1.isna()

     age   born   name    toy
0  False   True  False   True
1  False  False  False  False
2   True  False  False  False

In [10]:
df1.isnull()

     age   born   name    toy
0  False   True  False   True
1  False  False  False  False
2   True  False  False  False

In [16]:
df1[df1.isna().any(axis=1)]

   age       born    name    toy
0  5.0        NaT  Alfred   None
2  NaN 1940-04-25          Joker

In [18]:
df1.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['age', 'born', 'name', 'toy'], dtype='object')]

In [24]:
df1.loc[:, df1.isna().any()]

   age       born        toy
0  5.0        NaT       None
1  6.0 1939-05-27  Batmobile
2  NaN 1940-04-25      Joker